In [1]:
print("Hello world")

Hello world

In [2]:
x=10
y=2.30
z='I'
w="Hello"
print(x)

10

In [3]:
print(y)

2.3

In [4]:
print("ll",'O')

ll O

In [5]:
print("ll O")

ll O

In [6]:
t=29
print("just number",t)

just number 29

In [8]:
z=float(input("num1"))
x=input("enter message")
print("entered is",z,x)

num1 67
enter message bbhgg

entered is 67.0 bbhgg

In [9]:
print(type(x))

<class 'str'>

In [11]:
print(type (z))

<class 'float'>

In [12]:
str="HelloMasters"
print(str[3:7])
print(str[2:10:3])

lo,
l,a

In [13]:
print(str[-4:])

ters

In [7]:
print(str[3:7])

TypeError: 'type' object is not subscriptable

In [14]:
print(str[-4:10])

In [15]:
print(str.lower())

hello, masters

In [16]:
print(str.upper())

HELLO, MASTERS

In [17]:
print(str.isupper())

False

In [18]:
print(str)

Hello, Masters

In [19]:
print(str.islower())

False

In [20]:
print(str.isalpha())

False

In [21]:
print(str.isalpha())

False

In [22]:
st="helloMasters"
print(st.isalpha())

True

In [1]:
alp="12hello"
print(alp.isalpha())

False

In [4]:
"""Lorem ipsum dolor sit amet,
consectetur adipiscing elit,
sed do eiusmod tempor incididunt
ut labore et dolore magna aliqua."""
print(a)

Lorem ipsum dolor sit amet,
consectetur adipiscing elit,
sed do eiusmod tempor incididunt
ut labore et dolore magna aliqua.

In [6]:
"""Lorem ipsum dolor sit amet,
consectetur adipiscing elit,
sed do eiusmod tempor incididunt
ut labore et dolore magna aliqua."""

'Lorem ipsum dolor sit amet,\nconsectetur adipiscing elit,\nsed do eiusmod tempor incididunt\nut labore et dolore magna aliqua.'

In [8]:
string="hello good morning"
print(string.isspace())

False

In [9]:
strin="          "
print(strin.isspace())

True

In [13]:
fun="madam"
print(fun[-1:1])

In [15]:
list=[1,2,3,4]
list[0]='hr'
print(list)

['hr', 2, 3, 4]

In [17]:
list=[1,2,3,4]
list.append(8)
print(list)

[1, 2, 3, 4, 8]

In [18]:
list=[1,2,3,4]
list2=[3,7,6,2]
list.extend(list2)
print(list)

[1, 2, 3, 4, 3, 7, 6, 2]

In [19]:
touple=(1,2,32,"Value")
print(touple)

(1, 2, 32, 'Value')

In [20]:
touple=(1,2,32,"Value")
touple.append(3)
print(touple)

AttributeError: 'tuple' object has no attribute 'append'

In [21]:
str="hello"
print(str[::-1])

olleh

In [31]:
dicti={1:"hello",2.2:"happy","crazy":1}
print(dicti[1])

hello

In [27]:
dicti={1:"hello",2.2:"happy","crazy":1}
print(dicti[2.2])

happy

In [28]:
dicti=[1:"hello",2.2:"happy"]
print(dicti[1])

SyntaxError: invalid syntax (2653249196.py, line 1)

In [26]:
dictionary will accept duplicate keys

SyntaxError: invalid syntax (1136901092.py, line 1)

In [34]:
dici={1:"hello",2.2:"happy",1:"crazy"} # str={key:value}
print(dici[1])

crazy

In [35]:
list=[2,3,5,4,3,54,7]
if 2 in list:
    print("true")

true

In [36]:
list=[2,3,5,4,3,54,7]
if 2 not in list:
    print("true")

In [37]:
list=[2,3,5,4,3,54,7]
if 1 not in list:
    print("true")

true

In [38]:
string="this is string"
if "tr" in string:
    print("tr")

tr

In [39]:
string="this is string"
if "t g" in string:
    print("t g")

In [40]:
string="this is string"
if "ng" in string:
    print("ng")

ng

In [41]:
list=[2,3,5,4,3,54,7]
if 1 or 2 in list:
    print("true")

true

In [44]:
list=[2,3,5,4,3,54,7]
if (1 and 2) not in list:
    print("true")
else:
    print("false")

false

In [54]:
list1=[2,3,5,4,9,4,7]
list2=[2,566]
for i in list1:
    if i in list2:
        print("Yes")

Yes

In [56]:
def cal(x,y):
    return x+y

a=10
b=18
val=cal(a,b)
print(val)

28

In [57]:
def cal(x,y):
    return x+y
def cal(x,y):
    return x*y

a=10
b=18
val=cal(a,b)
print(val)

180

In [59]:
n=int(input("Enter the limit"))
val=int(input("Enter the values"))
if n<=val:
    key=int(input("Enter the key value"))
    for j in val:
        if key==j:
            print("found")
    else:
        print("not found")

Enter the limit4

TypeError: 'int' object is not iterable

In [ ]:
ele=sorted("Python")
print(ele) #it sorts the values based on the ASCII value

In [80]:
val1=input("Enter the value 1")
val2=input("Enter the value 2")
val1=val1.lower()
val2=val2.lower()
v1=sorted(val1)
v2=sorted(val2)
str1="".join(v1)
str2="".join(v2)
if(str1==str2):
    print('Anagram')
else:
    print('Not Anagram')

Enter the value 1are
Enter the value 2Ear
Anagram

In [116]:
val="happy Thoughts, happy You"
print(val.center(50,'*'))
print(val.count('h'))
print(val.endswith('r',3,7))
print(val.endswith('T',3,7)) #last-1
print(val.find("happy")) #used to find the word in the string if present return the index else return -1
print(val.find("Happy",3,8))
print(val.find("Happy",0,8))
print(val.index('Thoughts')) #return the index of the string
print(val.isprintable())
print(val.isupper())
value="12 UPPER"
print(value.isupper())
print(val.title())
print(val.capitalize())
print(val.upper())
print(val.lower())
string="hello vcet"
print(string.islower())
fun="This Is"
print(fun.istitle())
fun1="this 3is & vCET"
print(fun1.title())
print(fun1.capitalize())
print(fun1.rindex('vCET'))
print(fun1.rfind('11'))

************happy Thoughts, happy You*************
4
False
True
0
-1
-1
6
True
False
True
Happy Thoughts, Happy You
Happy thoughts, happy you
HAPPY THOUGHTS, HAPPY YOU
happy thoughts, happy you
True
True
This 3Is & Vcet
This 3is & vcet
11
-1

In [118]:
string="Hello world, Good morning"
print(string.split(" "))
print(string.split("o"))

['Hello', 'world,', 'Good', 'morning']
['Hell', ' w', 'rld, G', '', 'd m', 'rning']

In [119]:
string="Hello world, Good morning"
print(string.title())

Hello World, Good Morning

In [126]:
string="Hello world, Good morning"

x=(reversed(string))
x="".join(x)
print(x)

gninrom dooG ,dlrow olleH

In [7]:
def ls(li,key):
    for i in range(len(li)):
        if li[i]==key:
            return i
    return -1

lst=[]
while 1:
    ele=input("Enter element")
    if ele=="done":
        break
    lst.append(int(ele))
print(lst)
key=int(input("Enter key"))
res=ls(lst,key)
if res==-1:
    print("Element not found")
else:
    print("%d found at location %d"%(key,res))

Enter element5
Enter element9
Enter element8
Enter element6
Enter elementdone
[5, 9, 8, 6]
Enter key5
5 found at location 0

In [5]:
#in pyhton there is no concept of function overloading. if we write 3 functions with same name and different parameters it will perform with last function. if the parameters are not matched it will throw an error
#function overloading performed by using multipledispatch library

In [9]:
class Students:
    def __init__(self, name, rank, points):
        self.name = name
        self.rank = rank
        self.points = points
        
    def printfunction(self):
        print("I am",self.name)
        print("I got rank",self.rank)
        
str1 = Students("Kiran",1,100)
str2 = Students("Indu",2,90)

str1.printfunction()
str2.printfunction()

I am Kiran
I got rank 1
I am Indu
I got rank 2

In [13]:
class parent:
    def func1(self):
        print("Hello Parent")

class child(parent):
    def func2(self):
        print("Hello Child")
        
test = child()
test.func1()
test.func2()

Hello Parent
Hello Child

In [15]:
class Addition:
    def my_sum(self, a = None, b = None, c = None):
        s = 0
        if a != None and b != None and c != None:
            s = a + b + c
        elif a != None and b != None:
            s = a + b
        return s

obj = Addition()
print(obj.my_sum(10,20))
print(obj.my_sum(20,10,30))
print(obj.my_sum(20))

30
60
0

In [16]:
from multipledispatch import  dispatch

@dispatch(int, int)
def mul(a, b):
    return a * b

@dispatch(int, int, int)
def mul(a, b, c):
    return a * b * c

@dispatch(float, float, float)
def mul(a, b, c):
    return a * b * c

print(mul(2.1, 4.5, 5.4))
print(mul(2, 4, 6))
print(mul(3, 5))

51.03000000000001
48
15

In [27]:
n=int(input("Enter the number of elements"))
print("Enter",n,"array elements")
for i in range(n):
    l=[]
l.sort()
print(l)
# val=int(input("Enter the element to be inserted"))
# for i in range(len(l)):
#     if val>l[i]:

Enter the number of elements4
Enter 4 array elements
[]

In [3]:
###############################   PANDAS    ##################################

import pandas as pd
import numpy as np

In [29]:
d1 = {'name':['Sibin','Shruthi','Puneeth','Rashmi'],'class':['MCA','MBA','CS','MECH'],'marks':[100,30,80,60]}

In [30]:
df = pd.DataFrame(d1)

In [31]:
df

      name class  marks
0    Sibin   MCA    100
1  Shruthi   MBA     30
2  Puneeth    CS     80
3   Rashmi  MECH     60

In [6]:
df = pd.read_csv("dataset.csv")  #comma separated values

In [7]:
df#dataframe

   Sl. No.      Name Qualification      Mobile      Address
0        1   Puneeth           MCA  9606433418       Vittal
1        2    Rashmi           MBA  9874563210       Vittal
2        3   Shrunga         Civil  9638527410      Thumkur
3        4   Puneeth          MECH  9654786320  Belthangadi
4        5   Shruthi            CS  9654782312       Kumbra
5        6    Geetha           CSE  6598745230       Vittal
6        7    Soorya            AI  9875412036       Puttur
7        8  Mokshith            MA  8974563250          NaN
8        9   Shivani          MCOM  8569745632        Udupi
9       10   Vriddhi           MCA  9874561230       Puttur

In [8]:
df.head()

   Sl. No.     Name Qualification      Mobile      Address
0        1  Puneeth           MCA  9606433418       Vittal
1        2   Rashmi           MBA  9874563210       Vittal
2        3  Shrunga         Civil  9638527410      Thumkur
3        4  Puneeth          MECH  9654786320  Belthangadi
4        5  Shruthi            CS  9654782312       Kumbra

In [9]:
df.head(3)

   Sl. No.     Name Qualification      Mobile  Address
0        1  Puneeth           MCA  9606433418   Vittal
1        2   Rashmi           MBA  9874563210   Vittal
2        3  Shrunga         Civil  9638527410  Thumkur

In [10]:
df.tail()

   Sl. No.      Name Qualification      Mobile Address
5        6    Geetha           CSE  6598745230  Vittal
6        7    Soorya            AI  9875412036  Puttur
7        8  Mokshith            MA  8974563250     NaN
8        9   Shivani          MCOM  8569745632   Udupi
9       10   Vriddhi           MCA  9874561230  Puttur

In [11]:
df.tail(3)

   Sl. No.      Name Qualification      Mobile Address
7        8  Mokshith            MA  8974563250     NaN
8        9   Shivani          MCOM  8569745632   Udupi
9       10   Vriddhi           MCA  9874561230  Puttur

In [12]:
df["Name"] #series

0     Puneeth
1      Rashmi
2     Shrunga
3     Puneeth
4     Shruthi
5      Geetha
6      Soorya
7    Mokshith
8     Shivani
9     Vriddhi
Name: Name, dtype: object

In [13]:
df.describe()

        Sl. No.        Mobile
count  10.00000  1.000000e+01
mean    5.50000  9.232212e+09
std     3.02765  1.018801e+09
min     1.00000  6.598745e+09
25%     3.25000  9.132531e+09
50%     5.50000  9.646655e+09
75%     7.75000  9.819618e+09
max    10.00000  9.875412e+09

In [14]:
type(df)

pandas.core.frame.DataFrame

In [15]:
type(df["Name"])

pandas.core.series.Series

In [17]:
import pandas as pd
import numpy as np

#Read the data from the dataset into your pandas dataframe
data =  pd.read_csv("dataset.csv")

data.head(5)

#remove duplicate rows
data.drop_duplicates(subset=["Name"],keep="last",inplace=True)
data.head(10)

data.isnull().sum()

#Missing Data:
#Size of original dataset
print(data.shape)

#Dropping the missing rows
df_dropped=data.dropna()
data.head()

#Fill with provided value
data['Address']=data['Address'].fillna('Ubar')
data.head()

#Fill with provided value
mean_val=data['Mobile'].mean()
data['Mobile']=data['Mobile'].fillna(mean_val)
data


# #improving the modules
# #creating the Numpy array
# array=np.array([[1,1,1],[2,3,8],[3,5,27],])
# #creating the list of index names
# index_values=['Row1','Row2','Row3']
# #creating the list of column names
# column_values=['Col1','Col2','Col3']

(9, 5)

   Sl. No.      Name Qualification        Mobile      Address
1        2    Rashmi           MBA  9.874563e+09       Vittal
2        3   Shrunga         Civil  9.638527e+09      Thumkur
3        4   Puneeth          MECH  9.654786e+09  Belthangadi
4        5   Shruthi            CS  9.654782e+09       Kumbra
5        6    Geetha           CSE  6.598745e+09       Vittal
6        7    Soorya            AI  9.105034e+09       Puttur
7        8  Mokshith            MA  8.974563e+09         Ubar
8        9   Shivani          MCOM  8.569746e+09        Udupi
9       10   Vriddhi           MCA  9.874561e+09       Puttur